Autodesk.Revit.DB.IExportContextProxy.OnPolymesh(Autodesk.Revit.DB.PolymeshTopology)
This method is called when a tessellated polymesh of a 3d face is being output.
node:
A node representing topology of the polymesh
Since:
2014

Autodesk.Revit.DB.IExportContextProxy.OnMaterial(Autodesk.Revit.DB.MaterialNode)
This method marks a change of the material.
node:
A node describing the current material.
Since:
2014

Autodesk.Revit.DB.IExportContextProxy.OnLight(Autodesk.Revit.DB.LightNode)
This method marks the beginning of export of a light which is enabled for rendering.
Remarks:
This method is only called for photo-rendering export (a custom exporter that implements Autodesk.Revit.DB.IPhotoRenderContext).
node:
A node describing the light object.
Since:
2014

Autodesk.Revit.DB.IExportContextProxy.OnRPC(Autodesk.Revit.DB.RPCNode)
This method marks the beginning of export of an RPC object.
Remarks:
This method is only called for photo-rendering export (a custom exporter that implements Autodesk.Revit.DB.IPhotoRenderContext).
When an RPC object is encountered for a model context export (a custom exporter that implements Autodesk.Revit.DB.IModelExportContext),
the RPC object will be provided as a polymesh (via Autodesk.Revit.DB.IExportContextProxy.OnPolymesh(Autodesk.Revit.DB.PolymeshTopology)).
node:
A node with asset information about the RPC object.
Since:
2014

Autodesk.Revit.DB.IExportContextProxy.OnFaceEnd(Autodesk.Revit.DB.FaceNode)
This method marks the end of the current face being exported.
node:
An output node that represents a Face.
Since:
2014

Autodesk.Revit.DB.IExportContextProxy.OnFaceBegin(Autodesk.Revit.DB.FaceNode)
This method marks the beginning of a Face to be exported.
Remarks:
Note that this method (as well as OnFaceEnd) is invoked only if the custom
exporter was set up to include geometric objects in the output stream.
See Autodesk.Revit.DB.CustomExporter.IncludeGeometricObjects for mode details.
node:
An output node that represents a Face.
Returns:
Return RenderNodeAction. Proceed if you wish to receive geometry (polymesh)
for this face, or return RenderNodeAction.Skip otherwise.
Since:
2014

Autodesk.Revit.DB.IExportContextProxy.OnLinkEnd(Autodesk.Revit.DB.LinkNode)
This method marks the end of a link instance being exported.
node:
An output node that represents a Revit link.
Since:
2014

Autodesk.Revit.DB.IExportContextProxy.OnLinkBegin(Autodesk.Revit.DB.LinkNode)
This method marks the beginning of a link instance to be exported.
Returns:
Return RenderNodeAction.Skip if you wish to skip processing this link instance,
or return RenderNodeAction.Proceed otherwise.
Since:
2014

Autodesk.Revit.DB.IExportContextProxy.OnInstanceEnd(Autodesk.Revit.DB.InstanceNode)
This method marks the end of a family instance being exported.
node:
An output node that represents a family instance.
Since:
2014

Autodesk.Revit.DB.IExportContextProxy.OnInstanceBegin(Autodesk.Revit.DB.InstanceNode)
This method marks the beginning of a family instance to be exported.
Returns:
Return RenderNodeAction.Skip if you wish to skip processing this family instance,
or return RenderNodeAction.Proceed otherwise.
Since:
2014

Autodesk.Revit.DB.IExportContextProxy.OnElementEnd(Autodesk.Revit.DB.ElementId)
This method marks the end of an element being exported.
elementId:
The Id of the element that has just been processed.
Since:
2014

Autodesk.Revit.DB.IExportContextProxy.OnElementBegin(Autodesk.Revit.DB.ElementId)
This method marks the beginning of an element to be exported.
elementId:
The Id of the element that is about to be processed.
Returns:
Return RenderNodeAction.Skip if you wish to skip exporting this element,
or return RenderNodeAction.Proceed otherwise.
Since:
2014

Autodesk.Revit.DB.IExportContextProxy.OnViewEnd(Autodesk.Revit.DB.ElementId)
This method marks the end of a 3D view being exported.
elementId:
The Id of the 3D view that has just been processed.
Since:
2014

Autodesk.Revit.DB.IExportContextProxy.OnViewBegin(Autodesk.Revit.DB.ViewNode)
This method marks the beginning of a 3D view to be exported.
node:
Geometry node associated with the view.
Returns:
Return RenderNodeAction.Skip if you wish to skip exporting this view,
or return RenderNodeAction.Proceed otherwise.
Since:
2014

Autodesk.Revit.DB.IExportContextProxy.IsCanceled
This method is queried at the beginning of every element.
Returns:
Return True if you wish to cancel the exporting process, or False otherwise.
Since:
2014

Autodesk.Revit.DB.IExportContextProxy.Finish
This method is called at the very end of the export process,
after all entities were processed (or after the process was cancelled).
Since:
2014

Autodesk.Revit.DB.IExportContextProxy.Start
This method is called at the very start of the export process,
still before the first entity of the model was send out.
Returns:
Return True if you are ready to proceed with processing the export.
Since:
2014